const AboutPage = () => {
  return (
    <main className="p-6 max-w-4xl mx-auto flex flex-col md:flex-row gap-6 items-start">
      <div className="image-container">
        <img
          src="https://i.pinimg.com/736x/77/a8/b3/77a8b372fd2bc55d6a5b2c92698b568f.jpg"
          alt="Silly Cat"
          className="rounded-md w-full md:w-80 shadow-md"
        />
      </div>

      <p>
        Я студентка Житомирського політехнічного університету, спеціалізуюсь як у фронтенді,
        так і у бекенді. Маю великий інтерес до фінансового планування
        та допомоги іншим ефективно керувати своїми фінансами.
      </p>

      <p>
        За освітою я компьютерний інженер, із захопленням поглиблююся у коді
        та вирішую складні завдання. Моя подорож у світ програмування розпочалася
        університетом, де я відкрила свою любов до створення елегантних рішень для реальних завдань.
      </p>

      <p>
        Якщо у вас є які-небудь питання, потрібна допомога або ви бажаєте співпрацювати,
        будь ласка, звяжіться зі мною за нижчевказаними контактами.
        Я завжди рада спілкуванню з колегами програмістами та ентузіастами!
      </p>

    </main>
  );
};

export default AboutPage;
